{
  "num": 1,
  "blogs": [
    {
      "title": "Twenty",
      "author": "coleb",
      "date": "July 27, 2021",
      "paragraphs": [
        "The sun starts to creep towards the horizon as I pull up to a red stop light. Cars drive past in front of me from all directions.",
        "I squeeze the top of the steering wheel with my right hand and feel the oil from my palm on the plastic, leathery surface. Although I take this route everyday and have been for the last few months every day, I usually don't feel bored driving it. I notice new details each time, like dents on road signs, crookedness of stop lights, trees or bushes, and sometimes I'll see a store or restaurant that I'll swear wasn't there before.",
        "The light turns green and I begin a smooth acceleration forward. I always notice people who race past me and I wonder if they're in hurry. On a day like this I can't imagine having the smallest bit of urgency to do anything. Sometimes I'll think about it for a few minutes and create scenarios where this driver must get to their destination as soon as possible, but I usually just end up believing that they're impatient and feel the need to drive fast.",
        "I'm a librarian at the public library about 20 miles from my house. It's located in the middle of the city and my house is just on the outskirts, so driving there or back usually starts or ends with more traffic, depending on the location. I like to think of the drive as a progression or digression, sort of like my smooth acceleration when the light turns green or smooth deceleration when I'm approaching a red light. There's a number of metaphors I like to attach to the change, such as base level comparisons like going from urban to rural. Explaining this to someone is easy and they find it interesting that I notice it, and usually they will point out that I probably see more fields in the rural area and more commercial buildings in the urban area, maybe they will even go further and say in the middle I see lots of houses and neighborhoods like in a suburban area. The people I usually converse with this about are locals that come to the library in search of a good novel, who see me reading behind the checkout desk and wonder about me. I assume but I can't confirm that these people wonder about a lot of things and see me as easily approachable, obviously because they need to talk to me anyways if they are going to checkout a book. Usually I notice them standing near the bookshelves about 20 feet away, trying to make it seem like they're not paying attention to me. It's quite amusing sometimes actually, because we'll be the only two people in the library and the silence between us makes the idea of confrontation tense and puts pressure on their initial greeting when ready to checkout. When I talk about my drive, it's always with someone who I've never met, mostly because the first conversation I have with anyone naturally ends up at my drive. They'll ask where I live and I'll say in the outskirts of the city, then they'll ask something like what it's like living there (because most of them are from the city), or say how they love the expansive pastures and fields of the country, or sometimes they'll simply just ask about the drive. No matter what they say I'll always describe the progression. I say it softly with a smile and full of enjoyment, and a lot of times when I describe it I'll feel like I'm driving it again and at that point I feel very comfortable not only with that person, but with where I'm at. Their reactions are always the same, matching my comfortable smile, and most of the time they'll compliment my description of the progression and relate it to something they thought of when I brought it up. Like I said before, you can compare it to a seemingly endless amount of things, which makes it a great topic to bring up in conversation.",
        "I'm getting closer to the street where I live on, and the light that illuminates the road is becoming more sparse. I see cattle about a mile away that roam on a piece of land that is thousands of acres. Usually they are only a couple hundred of feet from the road, near a pond, but during the night they move to a warmer location which is probably by a farm or barn or something.",
        "I see life as simple and peaceful, so my daily routine feels perfectly fitting and the progression helps me feel the smoothness and beauty of change.",
        "Today was slightly different than most though. Upon waking, my head started hurting, like a severe headache but with pain that wasn't just in the forehead like it usually is, it felt like my entire brain was throbbing. I don't remember my dreams so sleep usually seems instant, as if I fall asleep in the night and only a second later it's morning time. This leads me to believe I had a bad dream, one that must've truly frightened me, I've just assumed I don't remember it. Luckily the pain went away about 20 minutes after I took some advil, and from then on I felt fine. Sometimes I like to connect events in my life when they give me the same vibe or when they seem related to me somehow, but I haven't been able to link the headache and the person I met about 20 minutes ago.",
        "That's misleading in some ways though, because the gentleman I spoke to didn't remind me of a bad headache, nor did he give off any negative vibes whatsoever. I'm not sure if I just want to connect the two pieces together because they happened on the same day, or if there is actually something substantial in between them, or if I just have a habit of making unrelated connections. Either way I refuse to let it go. To elaborate on what transpired, I was sitting in my usual spot in the library, preparing to lock the doors because it was almost closing time. With only a few minutes remaining, an older man walked through the door. He was wearing a large dark brown coat with lots of pockets in the front where his hands rest, black slacks that looked freshly ironed, black shoes, and a brown hat that I imagine looks similiar to the one Sherlock Holmes wears. He had pale white, wrinkly skin and if I had to guess I'd say he was in his mid to late 50's. When he opened the door, I slowly turned my head and met his gaze. My initial reaction was one of empathy, a desire to know more, and utter confusion, which if you could see my expression you'd probably see all of those emotions mashed together. The gentleman looked worried. He only glanced at me for a second and then his head turned back straight and he paced towards the non-fiction section. For some reason his face seemed familiar. And by familiar I don't mean he went to the library a few weeks ago, it was as if I'd seen him a long time ago, perhaps around town or pulled up beside me while stopped at a red light. His entrance at this time of night didn't easily pass me, I put down the novel I was reading, leaned back in my chair and created a pose that looked as if I was simply just thinking to myself, when really I was looking for the stranger and trying to place his identity somewhere in my life other than right now. He walked over to the 150s and I could only see parts of him through empty spaces in between the bookshelves. I looked at the clock. 7:58 PM. The library closed in 2 minutes.",
        "I say in a moderately loud, yet patient voice, \"the library closes at 8\". I can see his face turn towards the entrance where a clock hangs on the wall and reads the time.",
        "His face isn't unique. The man has bold features and nothing sticks out as something that should be memorable but it just is. I run my fingers through my hair and search through my memories. I try placing his face on someone I met last week, then last month. Nothing is connecting. I try to think back when I first got here but my mind rejects the command.",
        "I snap out of it when I realize he's walking towards me and is only a few feet away. He immediately holds a book out in front of him and me, and places it on my desk. \"Lost in the Subconscious Mind\", the title read."
      ]
    }
  ]
}